import React, {Component} from 'react';
import '../resources/css/global.css'


export default function TermsOfUse() {
    return <div className="main-content term-of-use-content">
        <h1>Соглашение об использовании данного ресурса</h1>
        <h2>Общие положения</h2>
        <ul>
            <li>При использовании ресурса(далее — "Сайт"), пользователь обязуется соблюдать все условия настоящего
                Соглашения (далее —
                "Соглашение")
            </li>
            <li>Разработчик Сайт оставляет за собой право изменять Соглашение. Пользователь самостоятельно
                отслеживает данные изменения и принимает решение о возможности дальнейшего использования Сайта
            </li>
        </ul>


        <h2> Обязательства Пользователя </h2>
        <ul>
            <li>Пользователь соглашается не предпринимать действий, которые могут рассматриваться как нарушающие
                белорусское
                законодательство или нормы международного права, в том числе в сфере интеллектуальной собственности,
                авторских
                и/или смежных правах, а также любых действий, которые приводят или могут привести к нарушению нормальной
                работы
                Сайта и сервисов Сайта.
            </li>

            <li>Использование материалов Сайта без согласия правообладателей не допускается. Для
                правомерного использования материалов Сайта необходимо заключение лицензионных договоров (получение
                лицензий) от
                Правообладателей.
            </li>
            <li> Пользователь предупрежден о том, что Разработчик Сайта не несет ответственности за посещение и
                использование им внешних ресурсов, ссылки на которые могут содержаться на сайте.
            </li>
            <li> Пользователь согласен с тем, что Разработчик Сайта не несет ответственности и не имеет прямых или
                косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или
                убытками,
                связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой регистрации,
                товарами
                или
                услугами, доступными на или полученными через внешние сайты или ресурсы либо иные контакты Пользователя,
                в
                которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.
            </li>
            <li> Пользователь принимает положение о том, что все материалы и сервисы Сайта или любая их часть могут
                сопровождаться рекламой. Пользователь согласен с тем, что Администрация Сайта не несет какой-либо
                ответственности и не имеет каких-либо обязательств в связи с такой рекламой.
            </li>

        </ul>

        <h2> Использование персональных данных Пользователя</h2>

        <ul>
            <li>Пользователь подтверждает свое согласие на обработку его персональных данных, включая IP-адрес и
                cookie
            </li>
            <li>Разработчик может публиковать на Сайте или передавать данные Пользователя третьи лицам в обезличенном
                виде
            </li>
            <li>Разработчик не несет ответственность за порядок использования персональной информации Пользователя
                третьими лицами, с которыми Пользователь взаимодействует в рамках использования Сайта
            </li>
        </ul>
    </div>
}